# 8. 데이터 선택(iloc)

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx')
df

  Unnamed: 0   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0         1번  채치수  북산고  197   90   85  100  95  85      Python
1         2번  정대만  북산고  184   40   35   50  55  25        Java
2         3번  송태섭  북산고  168   80   75   70  80  75  Javascript
3         4번  서태웅  북산고  187   40   60   70  75  80         NaN
4         5번  강백호  북산고  188   15   20   10  35  10         NaN
5         6번  변덕규  능남고  202   80  100   95  85  80           C
6         7번  황태산  능남고  188   55   65   45  40  35      PYTHON
7         8번  윤대협  능남고  190  100   85   90  95  95          C#

In [2]:
df.iloc[0] #0번째 위치의 데이터

Unnamed: 0        1번
이름               채치수
학교               북산고
키                197
국어                90
영어                85
수학               100
과학                95
사회                85
SW특기          Python
Name: 0, dtype: object

In [3]:
df.iloc[4]

Unnamed: 0     5번
이름            강백호
학교            북산고
키             188
국어             15
영어             20
수학             10
과학             35
사회             10
SW특기          NaN
Name: 4, dtype: object

In [4]:
df.iloc[0:5] #0에서 4번째 위치 데이터

  Unnamed: 0   이름   학교    키  국어  영어   수학  과학  사회        SW특기
0         1번  채치수  북산고  197  90  85  100  95  85      Python
1         2번  정대만  북산고  184  40  35   50  55  25        Java
2         3번  송태섭  북산고  168  80  75   70  80  75  Javascript
3         4번  서태웅  북산고  187  40  60   70  75  80         NaN
4         5번  강백호  북산고  188  15  20   10  35  10         NaN

In [5]:
df.iloc[0, 1] #0번째 row의 1번째 col 데이터

'채치수'

In [6]:
df.iloc[4, 2] #4번째 row의 2번째 col 데이터 (학교)

'북산고'

In [7]:
df.iloc[[0,1], 3] #0,1번째 row의 3번째 col 데이터 (키)

0    197
1    184
Name: 키, dtype: int64

In [8]:
df.iloc[[0,1], [3,4]] #0,1번째 row의 3번째,4번째 col 데이터 (키,국어)

     키  국어
0  197  90
1  184  40

In [9]:
df.iloc[0:5, 3:8] #0에서 4번째 위치 학생 중, 3-7번째 데이터

     키  국어  영어   수학  과학
0  197  90  85  100  95
1  184  40  35   50  55
2  168  80  75   70  80
3  187  40  60   70  75
4  188  15  20   10  35